backend/views/videos/index.php

            //'classid',
            //'subjid',
            //'chapterid',
            [
                'attribute'=>'classid',
                'filter'=>Html::activeDropDownList($searchModel, 'classid', ArrayHelper::map(Classes::find()->all(),'id','title'),['class'=>'form-control','prompt' => 'All']),
                'value'=> function($model)
                {
                    return $model->class ? $model->class->title : 'not set';
                }
            ],
            [
                'attribute'=>'subjid',
                'filter'=>Html::activeDropDownList($searchModel, 'subjid', ArrayHelper::map(Subjects::find()->all(),'id','title'),['class'=>'form-control','prompt' => 'All']),
                'value'=> function($model)
                {
                    return $model->subj ? $model->subj->title : 'not set';
                }
            ],
---
SELECT * FROM `classes` WHERE `id`=1
SELECT * FROM `classes`
SELECT * FROM `subjects` WHERE `id`=1
SELECT * FROM `subjects`