backend/views/student-subscriptions/index.php

SELECT * FROM `student` WHERE `id`=1
---
                'attribute' => 'studentid',
                'value' => function($model) {
                    if($model->studentid)
                        return $model->student->firstname." ". $model->student->lastname;