api/modules/v1/controllers/CustomersController.php

	public function actionRegistration()
	{
		// echo "<pre>"; print_r($_POST);exit;
		if (!empty($_POST)) {
    		try {
				$name = $_POST['name'];
				$email = $_POST['email'];
				$mobileno = $_POST['mobile'];
				$address = $_POST['address'];
				$passwordplain = "123456";
				$model = Customers::findOne(['email' => $email]);
---
SELECT * FROM `customers` WHERE `email`='dip@test.com'