api/modules/v1/controllers/TailorUsersController.php

SELECT * FROM `tailor_users` WHERE (`email`='test@gmail.com') AND (`password`='81dc9bdb52d04dc20036dbd8313ed055')
---
	public function actionLogin()
	{
		if (!empty($_POST)) {
			try {

				$email = $_POST['email'];
				$password = $_POST['password'];

				$model = TailorUsers::findOne(['email'=>$email,'password' => md5($password)]);

SELECT * FROM `tailor_users` WHERE `email`='vishal@gmail.com'
---
	public function actionRegistration()
	{
		// echo "<pre>"; print_r($_POST);exit;
		if (!empty($_POST)) {
    		try {
				$name = $_POST['name'];
				$email = $_POST['email'];
				$mobileno = $_POST['mobile'];
				$passwordplain = $_POST['password'];
				// $country_code = "IN";
				// if(isset($_POST['country_code']))
					// $country_code = $_POST['country_code'];
				$modelEmail = TailorUsers::findOne(['email' => $email]);

INSERT INTO `tailor_users` (`firstname`, `lastname`, `email`, `mobile`, `password`, `status`, `shop_name`, `updated`, `created`) VALUES ('Test', 'Adheli', 'vishal@gmail.com', '8309590372', '81dc9bdb52d04dc20036dbd8313ed055', 10, 'NA', '1506170554', '1506170554')
---
					$tailorUserModel->shop_name = "NA";
					$tailorUserModel->created = $tailorUserModel->updated= time();

					if ($tailorUserModel->save())