backend/views/subject-chapters/index.php

SELECT * FROM `classes` WHERE `id`=2
SELECT * FROM `classes`
SELECT * FROM `subjects` WHERE `id`=3
SELECT * FROM `subjects`
---
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            [
                'attribute'=>'classid',
                'filter'=>Html::activeDropDownList($searchModel, 'classid', ArrayHelper::map(Classes::find()->all(),'id','title'),['class'=>'form-control','prompt' => 'All']),
                'value'=> function($model)
                {
                    return $model->class->title;
                }
            ],
            [
                'attribute'=>'subjid',
                'filter'=>Html::activeDropDownList($searchModel, 'subjid', ArrayHelper::map(Subjects::find()->all(),'id','title'),['class'=>'form-control','prompt' => 'All']),
                'value'=> function($model)
                {
                    return $model->subj->title;
                }
            ],